Repository: Glaux-PA/crossref-omp
Catalog: locale/*/locale.po
Languages: ca_es, fi_fi

# plugins.importexport.crossrefOmp.displayName
source: Crossref XML Plugin
ca_es: Plugin Crossref XML
fi_fi: Crossref XML -lisäosa

# plugins.importexport.crossrefOmp.description
source: Deposite submissions in OMP's crossref XML format.
ca_es: Deposita envios en OMP a Crossref en formato XML.
fi_fi: Tallenna OMP-järjestelmässä muodostettuja DOI-tunnuksia Crossref-palveluun.

# plugins.importexport.crossrefOmp.deposited
source: Deposited
ca_es: Depositado
fi_fi: Tallennettu

# plugins.importexport.crossrefOmp.depositedSubmissions
source: Deposited submissions
ca_es: Envios depositados
fi_fi: Tallennetut käsikirjoitukset

# plugins.importexport.crossrefOmp.deposit
source: Deposit
ca_es: Depositar
fi_fi: Tallenna

# plugins.importexport.crossrefOmp.export
source: Export
ca_es: Exportar
fi_fi: Vie tiedostoon

# plugins.importexport.crossrefOmp.queued
source: To Deposit
ca_es: Pendiente de depositar
fi_fi: Tallentamatta

# plugins.importexport.crossrefOmp.redeposit
source: Deposit Again
ca_es: Volver a depositar
fi_fi: Tallenna uudelleen

# plugins.importexport.crossrefOmp.submittedSubmissions
source: Select monographs to export
ca_es: Selecciona monografías para exportar
fi_fi: Valitse teokset

# plugins.importexport.crossrefOmp.results
source: Results
ca_es: Resultados
fi_fi: Tulokset

# plugins.importexport.crossrefOmp.settings.description
source: Description
ca_es: Descripción
fi_fi: Kuvaus

# plugins.importexport.crossrefOmp.intro
source: This plugin registers DOIs for monographs and chapters for DOI provider <a href='https://crossref.org'>Crossref.org</a>.
ca_es: Este plugin registra DOI para monografías y capítulos para el proveedor de DOI <a href='https://crossref.org'>Crossref.org</a>.
fi_fi: Tämä lisäosa tallentaa DOI-tunnuksia teoksille ja luvuille <a href='https://crossref.org'>Crossref.org</a>-palveluun.

# plugins.importexport.crossrefOmp.settings
source: Settings
ca_es: Ajustes
fi_fi: Asetukset

# plugins.importexport.crossrefOmp.settings.form.password
source: Password
ca_es: Contraseña
fi_fi: Salasana

source: plugins.importexport.crossrefOmp.settings.form.password.description
ca_es: Contraseña del portal de Crossref

# plugins.importexport.crossrefOmp.settings.form.username
source: Crossref username
ca_es: Usuario Crossref
fi_fi: Käyttäjänimi

# plugins.importexport.crossrefOmp.settings.form.usernameRequired
source: Please enter the username you got from Crossref.
ca_es: Ingrese el nombre de usuario de Crossref.
fi_fi: Anna Crossrefilta saatu käyttäjänimi.

# plugins.importexport.crossrefOmp.settings.form.testMode.description
source: Use the Crossref test API for DOI registration. Please do not forget to remove this option for the production.
ca_es: Usar la API de pruebas te Crossref para el registro de DOI. No olvide cambiar esto para la puesta en producción.
fi_fi: Käytä Crossref-testirajapintaa. Muista poistaa tämä asetus tuotantokäytössä.

# plugins.importexport.crossrefOmp.senderTask.name
source: Crossref automatic registration task
ca_es: Tarea de registro automático de Crossref

# plugins.importexport.crossrefOmp.register.error.mdsError
source: Registration was not fully successful! The DOI registration server returned an error.
ca_es: El registro no se realizó correctamente! El servidor de registro de DOI devolvió un error.
fi_fi: Rekisteröinti ei onnistunut! Palvelin palautti virheen.

# plugins.importexport.crossrefOmp.register.success
source: Registration was successful!
ca_es: El registro se realizó correctamente!
fi_fi: Rekisteröinti onnistui!

# plugins.importexport.crossrefOmp.chapterDoiCount
source: Chapter DOIs
ca_es: Capítulos DOIs
fi_fi: Lukujen DOIt

# plugins.importexport.crossrefOmp.notice.noIsbn
source: Note! No ISBN available. Crossref export will use 'noisbn' selection.
ca_es: Nota! No existe el ISBN. Crossref exportará usando la opción 'noisbn'.
fi_fi: Huom! Ei ISBN-tunnusta. Viennissä käytetään 'noisbn'-valintaa.

# plugins.importexport.crossrefOmp.monographsOrChapter
source: Monographs / Chapters
ca_es: Monografías / Capítulos
fi_fi: Teokset / Luvut

# plugins.importexport.crossrefOmp.error
source: Error
fi_fi: Virhe
